(function () {
    var a_idx = 0;
    window.onclick = function (event) {
        var a = new Array("❤不以物喜 不以己悲❤",                          
                          "❤驿寄梅花 鱼传尺素❤",
                          "❤清风徐来，水波不兴❤",
                          "❤顺遂无虞 皆得所愿❤", 
                          "❤小阁藏春 闲窗锁昼❤", 
                          "❤云间玉兔 水面苍龙❤", 
                          "❤失之东隅 收之桑榆❤", 
                          "❤行到水穷处 坐看云起时❤", 
                          "❤昨日之深渊 今日之浅谈❤", 
                          "❤路虽远 行则将至❤",
                          "❤事虽难 做则可成❤", 
                          "❤辞暮尔尔 烟火年年❤", 
                          "❤海压竹枝低复举 风吹山脚晦还明❤", 
                          "❤我本无意惹惊鸿 奈何惊鸿入我心❤",
                          "❤清阳曜灵 和风容与❤",
                          "❤海棠未雨 梨花先雪❤", 
                          "❤西风驿马 落叶书灯❤",
                          "❤醉月悠悠 漱石休休❤", 
                          "❤萱堂日永 兰阁风薰❤",
                          "❤且行且忘且随风 且行且看且从容❤", 
                          "❤春祺夏安 秋绥冬禧❤", 
                          "❤真正的太阳 不是假借日光的月亮能比的❤",
                          "❤越想敲的门 叩的声越轻❤",
                          "❤椿萱并茂 棠棣同馨❤", 
                          "❤拨雪寻春 烧灯续昼❤",
                          "❤璧玉月晴 黛云远淡❤", 
                          "❤浅予深深 长乐未央❤",
                          "❤身如芥子 心藏须弥❤", 
                          "❤得失从缘 心无增减❤", 
                          "❤生而热忱 终也欢洽❤", 
                          "❤但逢良辰 顺颂时宜❤", 
                          "❤绿苔生阁 芳尘凝榭❤", 
                          "❤雨叶吟蝉 露草流萤❤", 
                          "❤欢愉且胜意 万事犹可期❤", 
                          "❤漫漫迷途 终有一归❤", 
                          "❤筚路蓝缕 以启山林❤", 
                          "❤梨花暮雨 燕子空楼❤", 
                          "❤半溪明月 一枕清风❤", 
                          "❤功崇惟志 业广惟勤❤",
                          "❤山不让尘 川不辞盈❤", 
                          "❤大音希声 大象无形❤",
                          "❤此生尽兴 赤诚善良❤", 
                          "❤希君生羽翼 一化北溟鱼❤",
                          "❤方生方死 方死方生❤",
                          "❤高山仰止 景行行止❤", 
                          "❤执着于理想 纯粹于当下❤",
                          "❤薄衣初试 绿蚁新尝❤", 
                          "❤海棠铺绣 梨花飘雪❤", 
                          "❤枯木逢春 不负众望❤", 
                          "❤去更远的地方，见更亮的光❤",
                          "❤一鸣从此始 相望青云端❤",
                          "❤如松柏之茂 无不尔或承❤",
                          "❤历添新岁月 春满旧山河❤",
                          "❤柳上烟归 池南雪尽❤", 
                          "❤窗中远岫 舍后长松❤",
                          "❤否极泰来物极必反❤",
                          "❤山高海阔往前走❤",
                          "❤绛雪生凉 碧霞笼夜❤", 
                          "❤鹤别空山 不见桃花❤",
                          "❤鹰击天风壮 鹏飞海浪春❤",
                          "❤雾失楼台 月迷津渡❤", 
                          "❤沧波万顷 月流烟渚❤",
                          "❤丹墀对策三千字 金榜题名五色春❤", 
                          "❤摩霄志在潜修羽 会接鸾凰别苇丛❤", 
                          "❤静宁见春 祉猷并茂❤",
                          "❤我们无法判断一个瞬间的价值 直至成为回忆❤",
                          "❤若答非所问，便已是答了❤",
                          "❤青春是一本太过仓促的书 我们含着泪 一读再读❤",
                          "❤重重似画 曲曲如屏❤",
                          "❤在日落大道浪漫出逃 除了风没有别人知道❤",
                          "❤我觉君非池中物 咫尺蛟龙翻云雨❤", 
                          "❤为者常戒 行者常至❤",
                          "❤翩若惊鸿 婉若蛟龙❤",
                          "❤春风得意马蹄疾 一日看尽长安花❤", 
                          "❤苍山负雪 明烛天南❤",
                          "❤浮光跃金 静影沉璧❤",
                          "❤霜蹄千里骏 风翮九霄鹏❤", 
                          "❤鱼翻藻鉴 鹭点烟灯❤", 
                          "❤天地无尘 山河有影❤", 
                          "❤白露暖空 素月流天❤", 
                          "❤红衣入浆 青灯摇浪❤",
                          "❤苦学酬身世 佳名播帝畿❤",
                          "❤但逢良辰 顺颂时宜❤", 
                          "❤知君志不小 一举凌鸿鹄❤",
                          "❤宫粉雕痕 仙云堕影❤", 
                          "❤尘随马去 月逐舟行❤", 
                          "❤骊珠难隐耀 皋鹤会长鸣❤",
                          "❤明年此日青云去 却笑人间举子忙❤",
                          "❤花下归来 带月敲门❤", 
                          "❤松花酿酒 春水煎茶❤",
                          "❤莫愁前路无知己 天下谁人不识君❤", 
                          "❤人生天地间 忽如远客行❤",
                          "❤人生如逆旅 我亦是行人❤",
                          "❤人生到处知何似 应似飞鸿踏雪泥❤",
                          "❤雄关漫漫真如铁 而今迈步从头越❤",
                          "❤一万年太久 只争朝夕❤",                          
                          "❤草际鸣蛰 惊落梧桐❤", 
                          "❤最是人间留不住 朱颜辞镜花辞树❤",
                          "❤月光还是少年的月光 九州一色还是李白的霜❤",                          
                          "❤只要想起一生中后悔的事情 梅花便落满了南山❤",
                        )

        var heart = document.createElement("b"); //创建b元素
        heart.onselectstart = new Function('event.returnValue=false'); //防止拖动

        document.body.appendChild(heart).innerHTML = a[a_idx]; //将b元素添加到页面上
        a_idx = (a_idx + 1) % a.length;
        heart.style.cssText = "position: fixed;left:-100%;"; //给p元素设置样式

        var f = 16, // 字体大小
            x = event.clientX - f / 2, // 横坐标
            y = event.clientY - f, // 纵坐标
            c = randomColor(), // 随机颜色
            a = 1, // 透明度
            s = 1.2; // 放大缩小

        var timer = setInterval(function () { //添加定时器
            if (a <= 0) {
                document.body.removeChild(heart);
                clearInterval(timer);
            } else {
                heart.style.cssText = "font-size:16px;cursor: default;position: fixed;color:" +
                    c + ";left:" + x + "px;top:" + y + "px;opacity:" + a + ";transform:scale(" +
                    s + ");";

                y--;
                a -= 0.016;
                s += 0.002;
            }
        }, 15)

    }
    // 随机颜色
    function randomColor() {

        return "rgb(" + (~~(Math.random() * 255)) + "," + (~~(Math.random() * 255)) + "," + (~~(Math
            .random() * 255)) + ")";

    }
}());
